In [62]:
import pandas as pd
from pandas import DataFrame, Series
import numpy as np
from numpy import random, array

In [63]:
ser = Series(data=random.randint(0, 10, 10))
ser

0    7
1    3
2    7
3    7
4    4
5    6
6    0
7    9
8    3
9    4
dtype: int32

In [64]:
sorted(ser.unique())

[0, 3, 4, 6, 7, 9]

In [65]:
ser.value_counts()

7    3
4    2
3    2
9    1
6    1
0    1
dtype: int64

In [66]:
ser.isin([5, 6])

0    False
1    False
2    False
3    False
4    False
5     True
6    False
7    False
8    False
9    False
dtype: bool

In [126]:
df = DataFrame(data=[list("aabcd"), list("bcaad"), list("abcde"), list("bcdae")], columns=list("ABCDE"))
df

   A  B  C  D  E
0  a  a  b  c  d
1  b  c  a  a  d
2  a  b  c  d  e
3  b  c  d  a  e

In [127]:
df.apply(pd.value_counts)

     A    B    C    D    E
a  2.0  1.0  1.0  2.0  NaN
b  2.0  1.0  1.0  NaN  NaN
c  NaN  2.0  1.0  1.0  NaN
d  NaN  NaN  1.0  1.0  2.0
e  NaN  NaN  NaN  NaN  2.0

In [128]:
df.drop(columns='A')

   B  C  D  E
0  a  b  c  d
1  c  a  a  d
2  b  c  d  e
3  c  d  a  e

In [129]:
df['key'] = list("aabb")
df.index = [1, 2, 1, 2]
df.set_index([df['key'], df.index], inplace=True, drop=True)
df

       A  B  C  D  E key
key
a   1  a  a  b  c  d   a
    2  b  c  a  a  d   a
b   1  a  b  c  d  e   b
    2  b  c  d  a  e   b

In [130]:
df.drop(index=2, level=1)

       A  B  C  D  E key
key
a   1  a  a  b  c  d   a
b   1  a  b  c  d  e   b

In [131]:
df = df.apply(pd.value_counts)
df

     A    B    C    D    E  key
a  2.0  1.0  1.0  2.0  NaN  2.0
b  2.0  1.0  1.0  NaN  NaN  2.0
c  NaN  2.0  1.0  1.0  NaN  NaN
d  NaN  NaN  1.0  1.0  2.0  NaN
e  NaN  NaN  NaN  NaN  2.0  NaN

In [149]:
df.dropna(thresh=3, axis=1)

     B    C    D
a  1.0  1.0  2.0
b  1.0  1.0  NaN
c  2.0  1.0  1.0
d  NaN  1.0  1.0
e  NaN  NaN  NaN

In [142]:
df.fillna(method="bfill")

     A    B    C    D    E  key
a  2.0  1.0  1.0  2.0  2.0  2.0
b  2.0  1.0  1.0  1.0  2.0  2.0
c  NaN  2.0  1.0  1.0  2.0  NaN
d  NaN  NaN  1.0  1.0  2.0  NaN
e  NaN  NaN  NaN  NaN  2.0  NaN

In [157]:
df.fillna({'A': df['A'].mean(), 
           'B': df['B']})

       A      B    C    D    E  key
a    2.0    1.0  1.0  2.0  NaN  2.0
b    2.0    1.0  1.0  NaN  NaN  2.0
c  100.0    2.0  1.0  1.0  NaN  NaN
d  100.0  200.0  1.0  1.0  2.0  NaN
e  100.0  200.0  NaN  NaN  2.0  NaN